scenarios/blazedemo.yml
execution:
- concurrency: 100
  ramp-up: 30s
  hold-for: 1m30s
  scenario: quick-test

scenarios:
  quick-test:
    requests:
    - http://blazedemo.com
    - http://blazedemo.com/vacation.html

settings:
  check-interval: 3s
  default-executor: jmeter
  artifacts-dir: ./artifacts
  check-updates: true

reporting:
- final-stats
- console
- blazemeter