scenarios/blazedemo.yml
execution:
- concurrency: 100
  ramp-up: 1m
  hold-for: 2m
  scenario: quick-test

scenarios:
  quick-test:
    requests:
    - http://blazedemo.com

settings:
  check-interval: 5s
  default-executor: jmeter
  artifacts-dir: ./artifacts
  check-updates: true

reporting:
- final-stats
- console
- blazemeter