scenarios/blazedemo.yml
execution:
- concurrency: 10
  ramp-up: 20s
  hold-for: 1m
  scenario: quick-test

scenarios:
  quick-test:
    requests:
    - http://blazedemo.com
    - http://blazedemo.com/vacation.html

settings:
  check-interval: 3s
  default-executor: jmeter
  artifacts-dir: ./artifacts
  check-updates: true

reporting:
- blazemeter